УТ_для_edt/src/Documents/смартУправлениеАкциями/смартУправлениеАкциями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУправлениеАкциями</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <registerRecords>AccumulationRegister.смартОстаткиАкционныхТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныРозница</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАкции</name>
    <type>
      <types>EnumRef.смартВидыАкций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаРозница</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаАкция</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборудованиеДемозала</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТоваров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусСумма</name>
      <comment>//++ #Б-7562 смарт: Фролов 29.07.2026 //Управление акциями. Добавить колонку Бонусы в руб. в документ Управление акциями</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартУправлениеАкциями/Forms/ТекущиеАкции/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	
	Если Параметры.Свойство("АдресТаблицыАкций") Тогда
		
		ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыАкций);
		ТаблицаАкцийВДокументе.Загрузить(ТЗ);
		
	КонецЕсли;
	
	ОбновитьСписокДоступныхАкций();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытияЭлементов

&НаКлиенте
Процедура ДоступныеАкцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		
		ДоступныеАкцииВыборСервер(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоступныеАкцииВыборСервер(ВыбраннаяСтрока)
	
	СтрокаАкция = ТаблицаДоступныхАкций.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ТЗ = ТаблицаДоступныхАкций.Выгрузить(Новый Структура("ВидАкции", Неопределено));
	СтруктураПоиска = Новый Структура;
	Для каждого стрКолонка Из ТЗ.Колонки Цикл
		СтруктураПоиска.Вставить(стрКолонка.Имя, СтрокаАкция[стрКолонка.Имя]);
	КонецЦикла;
	
	СтруктураПоиска.Удалить("Количество");
	СтруктураПоиска.Удалить("ПроцентСкидки");
	СтруктураПоиска.Удалить("ЦенаРозница");
	СтруктураПоиска.Удалить("КодСтроки");
	
	НайденныеСтроки = ТаблицаАкцийВДокументе.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(СтрокаАкция.Серия) Тогда
		
		Возврат;
		
	ИначеЕсли НайденныеСтроки.Количество() > 0 Тогда
		
		Если НайденныеСтроки[0].КоличествоДобавлено < СтрокаАкция.Количество Тогда
			НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + 1;
			НайденныеСтроки[0].КоличествоДобавлено = НайденныеСтроки[0].КоличествоДобавлено + 1;
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		
		НоваяСтрока = ТаблицаАкцийВДокументе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаАкция);
		НоваяСтрока.Количество = 1;
		НоваяСтрока.КоличествоДобавлено = 1;
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ПоместитьАцииДляПередачиВДокумент()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаАкцийВДокументе.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(ПоместитьАцииДляПередачиВДокумент());
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ОбновитьСписокДоступныхАкций()
	
	ТаблицаДоступныхАкций.Очистить();
	
	ПараметрыАкций = Новый Структура;
	ПараметрыАкций.Вставить("Организация", Организация);
	
	ТЗАкций = смартАкцииИСкидки.ПолучитьДействующиеАкции(ТекущаяДата(), ПараметрыАкций);
	
	Для каждого стрАкция ИЗ ТЗАкций Цикл
		
		НоваяСтрока = ТаблицаДоступныхАкций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стрАкция);
		НоваяСтрока.ПроцентСкидки = ?(НоваяСтрока.ЦенаРозница = 0, 0, (НоваяСтрока.ЦенаРозница - НоваяСтрока.ЦенаАкция) * 100 / НоваяСтрока.ЦенаРозница);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
